# Pandas

In [1]:
import pandas as pd

In [14]:
df = pd.DataFrame()
print(df)

companies = ['apple', 'facebook', 'google', 'amazon', 'spacex', 'tesla']
df_companies = pd.DataFrame(companies)
print(df_companies)
print('\n')

companies = [['apple',123],['facebook',345], ['google',213], ['amazon',332], ['spacex',332], ['tesla',331]]
df_companies = pd.DataFrame(companies, columns=['Company', 'Code'])
print(df_companies)
print('\n')

companies = {'apple':[123,321], 'facebook':[345,332], 'google':[213,222]}
df_companies = pd.DataFrame(companies, index=['January', 'June'])
print(df_companies)

Empty DataFrame
Columns: []
Index: []
          0
0     apple
1  facebook
2    google
3    amazon
4    spacex
5     tesla


    Company  Code
0     apple   123
1  facebook   345
2    google   213
3    amazon   332
4    spacex   332
5     tesla   331


         apple  facebook  google
January    123       345     213
June       321       332     222

In [24]:
df_titanic = pd.read_csv('titanic.csv') # You can also specify other separators with sep=...
df_titanic.head()

In [25]:
df_companies.to_csv('dummy.csv', encoding='utf-8', index=False)
df_titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [27]:
# Transposing the dataframe
df_companies.T

          January  June
apple         123   321
facebook      345   332
google        213   222

In [28]:
# Dimensions of the Data Frame
df_companies.ndim

2

In [30]:
# Rows and columns
df_companies.shape

(2, 3)

In [32]:
# Size of the Data Frame. Basically rowsxcolumns
df_companies.size

6